9/data/attachments/980a684063f73945.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_b59bebe6-15b4-4d81-9415-b1a2745429cf</nif:username>
            <nif:friendToBeAdded>Jesse_usually_Friend_70004_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>